using ERP.Enum.Attribute;

namespace ERP.Enum
{
    /************************************************************************************ 
     * 创建人：  文雯
     * 创建时间：2016/8/11 13:34:20 
     * 描述    : 红冲类型
     * =====================================================================
     * 修改时间：2016/8/11 13:34:20 
     * 修改人  ：  
     * 描述    ：
     */
    public enum RedType
    {
        /// <summary>
        /// 调价入库红冲
        /// </summary>
        [Enum("调价入库红冲")]
        ModifyPriceInRed = 1,
        /// <summary>
        /// 调价出库红冲
        /// </summary>
        [Enum("调价出库红冲")]
        ModifyPriceOutRed = 2
    }
}
